Autodesk.Revit.DB.PropertyTableEntryCurveType
An enumerated type that represents the curve types supported in a table entry for a PropertyLine element.
Since:
2027

Autodesk.Revit.DB.PropertyTableEntryCurveType.Arc
An Arc

Autodesk.Revit.DB.PropertyTableEntryCurveType.Line
A Line